"""Вводится целое неотрицательное число N (N≤100).
    Выведите 2ᴺ.
"""
number = 2
n = int(input())
print(number**n)
