"""
Дано двузначное число. Найдите число десятков в нем.
"""

n = input()
print(n[0])
