"""Дано натуральное число.
Выведите его последнюю цифру.
Вводится единственное целое неотрицательное число
(гарантируется, что оно не превышает 10000).
"""

n = input()
print(n[-1])
